In [4]:
!pip install SQLAlchemy==2.0.29
!pip install mysql-connector-python==8.3.0
!pip install mysqlclient==2.2.4

Collecting SQLAlchemy==2.0.29
  Downloading SQLAlchemy-2.0.29-cp311-cp311-win_amd64.whl (2.1 MB)
     ---------------------------------------- 2.1/2.1 MB 1.9 MB/s eta 0:00:00
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\john\documents\estudio\boocamp ia data engineer\clase 08\dep29\dep29ingenieria_datos\sesion3\.venv\lib\site-packages (from SQLAlchemy==2.0.29) (4.15.0)
Collecting greenlet!=0.4.17
  Using cached greenlet-3.3.0-cp311-cp311-win_amd64.whl (301 kB)
Installing collected packages: greenlet, SQLAlchemy
Successfully installed SQLAlchemy-2.0.29 greenlet-3.3.0

[notice] A new release of pip available: 22.3.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

Collecting mysql-connector-python==8.3.0
  Downloading mysql_connector_python-8.3.0-cp311-cp311-win_amd64.whl (15.4 MB)
     ---------------------------------------- 15.4/15.4 MB 4.3 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.3.0

[notice] A new release of pip available: 22.3.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

Collecting mysqlclient==2.2.4
  Downloading mysqlclient-2.2.4-cp311-cp311-win_amd64.whl (203 kB)
     -------------------------------------- 203.2/203.2 kB 6.2 MB/s eta 0:00:00
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.2.4

[notice] A new release of pip available: 22.3.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\john\appdata\local\programs\python\python313\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\john\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.4.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\john\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\john\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\john\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\john\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.3.1 -> 25.3
[notice] To update, run: C:\Users\John\AppData\Local\Programs\Python\Python313\python.exe -m pip install --upgrade pip

In [6]:
pip install --upgrade SQLAlchemy

Requirement already satisfied: SQLAlchemy in c:\users\john\appdata\local\programs\python\python313\lib\site-packages (2.0.29)
Collecting SQLAlchemy
  Downloading sqlalchemy-2.0.45-cp313-cp313-win_amd64.whl.metadata (9.8 kB)
Requirement already satisfied: greenlet>=1 in c:\users\john\appdata\local\programs\python\python313\lib\site-packages (from SQLAlchemy) (3.3.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\john\appdata\local\programs\python\python313\lib\site-packages (from SQLAlchemy) (4.15.0)
Downloading sqlalchemy-2.0.45-cp313-cp313-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ---- ----------------------------------- 0.3/2.1 MB ? eta -:--:--
   --------- ------------------------------ 0.5/2.1 MB 1.2 MB/s eta 0:00:02
   --------- ------------------------------ 0.5/2.1 MB 1.2 MB/s eta 0:00:02
   -------------- ------------------------- 0.8/2.1 MB 747.1 kB/s eta 0:00:02
   -------------- ------------------------- 0.8/2.1 MB 747.1 kB/s eta 0:00:02
   ------------------- -------------------- 1.0/2.1 MB 782.1 kB/s eta 0:00:02
   ------------------- -------------------- 1.0/2.1 MB 782.1 kB/s eta 0:00:02
   ---------------------------------- ----- 1.8/2.1 MB 1.0 MB/s eta 0:00:01
   ---------------------------------------- 2.1/2.1 MB 1.1 MB/s eta 0:00:00
Installing collected packages: SQLAlchemy
  Attempting uninstall: SQLAlchemy
    Found existing installation: SQLAlchemy 2.0.29
    Uninstalling SQLAlchemy-2.0.29:
      Successfully uninstalled SQLAlchemy-2.0.29
Successfully installed SQLAlchemy-2.0.45
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [5]:
pip install SQLAlchemy mysql-connector-python pandas

Requirement already satisfied: SQLAlchemy in c:\users\john\documents\estudio\boocamp ia data engineer\clase 08\dep29\dep29ingenieria_datos\sesion3\.venv\lib\site-packages (2.0.29)
Requirement already satisfied: mysql-connector-python in c:\users\john\documents\estudio\boocamp ia data engineer\clase 08\dep29\dep29ingenieria_datos\sesion3\.venv\lib\site-packages (8.3.0)
Collecting pandas
  Using cached pandas-2.3.3-cp311-cp311-win_amd64.whl (11.3 MB)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\john\documents\estudio\boocamp ia data engineer\clase 08\dep29\dep29ingenieria_datos\sesion3\.venv\lib\site-packages (from SQLAlchemy) (4.15.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\john\documents\estudio\boocamp ia data engineer\clase 08\dep29\dep29ingenieria_datos\sesion3\.venv\lib\site-packages (from SQLAlchemy) (3.3.0)
Collecting numpy>=1.23.2
  Downloading numpy-2.4.1-cp311-cp311-win_amd64.whl (12.6 MB)
     --------------------------------------- 12.6/12.6 MB 13.6 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\john\documents\estudio\boocamp ia data engineer\clase 08\dep29\dep29ingenieria_datos\sesion3\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1
  Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Collecting tzdata>=2022.7
  Using cached tzdata-2025.3-py2.py3-none-any.whl (348 kB)
Requirement already satisfied: six>=1.5 in c:\users\john\documents\estudio\boocamp ia data engineer\clase 08\dep29\dep29ingenieria_datos\sesion3\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.4.1 pandas-2.3.3 pytz-2025.2 tzdata-2025.3
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [5]:
pip install pandas sqlalchemy mysql-connector-python

Collecting pandas
  Downloading pandas-2.3.3-cp311-cp311-win_amd64.whl (11.3 MB)
     --------------------------------------- 11.3/11.3 MB 19.3 MB/s eta 0:00:00
Collecting sqlalchemy
  Downloading sqlalchemy-2.0.45-cp311-cp311-win_amd64.whl (2.1 MB)
     ---------------------------------------- 2.1/2.1 MB 19.5 MB/s eta 0:00:00
Collecting mysql-connector-python
  Downloading mysql_connector_python-9.5.0-cp311-cp311-win_amd64.whl (16.5 MB)
     --------------------------------------- 16.5/16.5 MB 19.9 MB/s eta 0:00:00
Collecting numpy>=1.23.2
  Downloading numpy-2.4.0-cp311-cp311-win_amd64.whl (12.6 MB)
     --------------------------------------- 12.6/12.6 MB 21.1 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\john\appdata\roaming\python\python311\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1
  Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
     ------------------------------------- 509.2/509.2 kB 31.2 MB/s eta 0:00:00
Collecting tzdata>=2022.7
  Downloading tzdata-2025.3-py2.py3-none-any.whl (348 kB)
     ------------------------------------- 348.5/348.5 kB 21.1 MB/s eta 0:00:00
Collecting greenlet>=1
  Downloading greenlet-3.3.0-cp311-cp311-win_amd64.whl (301 kB)
     ------------------------------------- 301.2/301.2 kB 18.2 MB/s eta 0:00:00
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\john\appdata\roaming\python\python311\site-packages (from sqlalchemy) (4.15.0)
Requirement already satisfied: six>=1.5 in c:\users\john\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Installing collected packages: pytz, tzdata, numpy, mysql-connector-python, greenlet, sqlalchemy, pandas
Successfully installed greenlet-3.3.0 mysql-connector-python-9.5.0 numpy-2.4.0 pandas-2.3.3 pytz-2025.2 sqlalchemy-2.0.45 tzdata-2025.3
Note: you may need to restart the kernel to use updated packages.

  WARNING: The scripts f2py.exe and numpy-config.exe are installed in 'c:\Users\John\AppData\Local\Programs\Python\Python311\Scripts' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.

[notice] A new release of pip available: 22.3.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [6]:
import pandas as pd # Libreria Pandas
import sqlalchemy as db

In [9]:
# Crear una conexion 
# Cadena: usuario, clave, host o servidor, puerto, nombre de la bd
engine = db.create_engine("mysql+mysqlconnector://root:root@127.0.0.1:3310/db_movies_netflix_transact")

#Establecemos op iniciamos la conexion
conn = engine.connect()

# Cargando Datos a Dimension Moview

In [16]:
query = """
    SELECT 
        movie.movieID as movieID, movie.movieTitle as title, movie.releaseDate as releaseDate,
        gender.name as gender , person.name as participantName, participant.participantRole as roleparticipant
    FROM movie
    INNER JOIN participant
    ON movie.movieID=participant.movieID
    INNER JOIN person
    ON person.personID = participant.personID
    INNER JOIN movie_gender
    ON movie.movieID = movie_gender.movieID
    INNER JOIN gender
    ON movie_gender.genderID = gender.genderID
    """

In [17]:
#Cargar los resultados de la consulta en DF
movies_data = pd.read_sql(query, con=conn)

#Transfromar a entero
movies_data["movieID"]=movies_data["movieID"].astype('int')

#Mostrar elementos
movies_data

,movieID,title,releaseDate,gender,participantName,roleparticipant
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director

In [18]:
# Cargar un CSV
movies_award = pd.read_csv("./data/Awards_movie.csv")

# Transformar el id a entero
movies_award["movieID"] = movies_award["movieID"].astype('int')

# Renombrar la columna de premio
movies_award.rename(columns={"Aware": "Award"}, inplace=True)

movies_award

    movieID  IdAward   Award
0  80210920        0   Oscar
1  81157374        1  Grammy
2  80192187        2   Oscar

In [19]:
# Cruzar (join) 
movies_data_final = pd.merge(movies_data,movies_award,
                                left_on="movieID", right_on="movieID"
)

movies_data_final

,movieID,title,releaseDate,gender,participantName,roleparticipant,IdAward,Award
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,2,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,0,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,1,Grammy

In [10]:
# Crear una conexion a la BD WareHouse
enginedw = db.create_engine("mysql+mysqlconnector://root:root@127.0.0.1:3310/dw_netflix")

conn_dw = enginedw.connect()

In [20]:
# Renombrar dos columnas
movies_data_final = movies_data_final.rename(columns={"releaseDate":"releaseMovie","Award":"awardMovie"})

# Eliminar un campo
movies_data_final = movies_data_final.drop(columns=['IdAward'])

In [20]:
movies_data_final

,movieID,title,releaseMovie,gender,participantName,roleparticipant,awardMovie
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,Grammy

In [21]:
movies_data_final.to_sql('dimMovie', conn_dw, if_exists='append', index=False)

3

# Cargar Dimension User

In [7]:
#Cargando al tabla usuario
users = pd.read_csv('./data/users.csv', sep='|')

users.head()

    idUser     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [13]:
users = users.rename(columns = {'idUser':'userID'})

users.head()

    userID     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [14]:
#Ingestar a la BD
users.to_sql('dimUser',conn_dw, if_exists='append',index=False)

20

# Cargamos datos a la tabla hechos

In [22]:
users_id = users['userID']

movies_id = movies_data_final['movieID']

In [23]:
users_id.head()

0    1002331
1    1002332
2    1002333
3    1002334
4    1002335
Name: userID, dtype: int64

In [24]:
movies_id.head()

0    80192187
1    80210920
2    81157374
Name: movieID, dtype: int64

In [25]:
whatchs_data = pd.merge(users_id,movies_id,how='cross')

whatchs_data

      userID   movieID
0    1002331  80192187
1    1002331  80210920
2    1002331  81157374
3    1002332  80192187
4    1002332  80210920
5    1002332  81157374
6    1002333  80192187
7    1002333  80210920
8    1002333  81157374
9    1002334  80192187
10   1002334  80210920
11   1002334  81157374
12   1002335  80192187
13   1002335  80210920
14   1002335  81157374
15   1002336  80192187
16   1002336  80210920
17   1002336  81157374
18   1002337  80192187
19   1002337  80210920
20   1002337  81157374
21   1002338  80192187
22   1002338  80210920
23   1002338  81157374
24   1002339  80192187
25   1002339  80210920
26   1002339  81157374
27  10023310  80192187
28  10023310  80210920
29  10023310  81157374
30  10023311  80192187
31  10023311  80210920
32  10023311  81157374
33  10023312  80192187
34  10023312  80210920
35  10023312  81157374
36  10023313  80192187
37  10023313  80210920
38  10023313  81157374
39  10023314  80192187
40  10023314  80210920
41  10023314  81157374
42  10023315  80192187
43  10023315  80210920
44  10023315  81157374
45  10023316  80192187
46  10023316  80210920
47  10023316  81157374
48  10023317  80192187
49  10023317  80210920
50  10023317  81157374
51  10023318  80192187
52  10023318  80210920
53  10023318  81157374
54  10023319  80192187
55  10023319  80210920
56  10023319  81157374
57  10023320  80192187
58  10023320  80210920
59  10023320  81157374

In [26]:
import random
from datetime import datetime,timedelta

def gen_rating():
    numero_aleatorio = round(random.uniform(0,5),1)

    return numero_aleatorio

def gen_timestamp():
    start_date = datetime(2024, 1 , 15)
    end_date = datetime(2024, 4, 6)

    random_date = start_date + timedelta(seconds=random.randint(0,int((end_date - start_date).total_seconds())))

    return random_date

In [27]:
whatchs_data['rating'] = whatchs_data['movieID'].apply(lambda x: gen_rating())

whatchs_data['timestamp'] = whatchs_data['userID'].apply(lambda x: gen_timestamp())

In [28]:
whatchs_data.head()

    userID   movieID  rating           timestamp
0  1002331  80192187     2.6 2024-04-02 00:00:42
1  1002331  80210920     4.5 2024-02-24 00:30:54
2  1002331  81157374     0.9 2024-02-13 12:46:09
3  1002332  80192187     1.9 2024-03-22 18:24:43
4  1002332  80210920     0.9 2024-03-07 13:40:29

In [29]:
#Cargar la data
whatchs_data.to_sql('FactWatchs', conn_dw, if_exists='append',index=False)

60